Revit 2027 API
RebarBarType.SetHookTangentLength Method
 Identifies the hook tangent length for a hook type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetHookTangentLength(
	ElementId hookId,
	double newLength
)
Public Sub SetHookTangentLength (
	hookId As ElementId,
	newLength As Double
)
public:
void SetHookTangentLength(
	ElementId^ hookId,
	double newLength
)
member SetHookTangentLength :
        hookId : ElementId *
        newLength : float -> unit
Parameters
hookId ElementId
 id of the hook type
newLength Double
 The hook tangent length for a hook type
Exceptions
Exception | Condition
ArgumentException |  the rebar hook type id hookId is not valid
ArgumentNullException |  A non-optional argument was null
Remarks
 AutoCalcHookLengths is ignored when this property is set
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace